Конфигурация/src/Documents/ПродажаНапитка/ПродажаНапитка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаНапитка</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиКофеен</registerRecords>
  <attributes>
    <name>ТорговаяТочка</name>
    <type>
      <types>CatalogRef.ЗаведенияСети</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.РаботникиКафе</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПродажи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЧека</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.КофеИНапитки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/ПродажаНапитка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция СоставЧекаНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КофеИНапитки.ЦенаПродажи КАК ЦенаПродажи
		|ИЗ
		|	Справочник.КофеИНапитки КАК КофеИНапитки
		|ГДЕ
		|	КофеИНапитки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЦенаПродажи;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура СоставЧекаНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	
	ТекущаяСтрока.СтавкаНДС = 22;
	
	ТекущаяСтрока.Цена = СоставЧекаНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.Номенклатура);
	СтавкаНДС = ТекущаяСтрока.Цена / (100 + ТекущаяСтрока.СтавкаНДС) * ТекущаяСтрока.СтавкаНДС;
	ТекущаяСтрока.Цена = ТекущаяСтрока.Цена + СтавкаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаКоличествоПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.СоставЧека.Итог("Сумма");

КонецПроцедуры

&НаКлиенте
Процедура СоставЧекаЦенаПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.СоставЧека.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
	
	Объект.Сумма =  Объект.СоставЧека.Итог("Сумма");

КонецПроцедуры
